app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      new_artist = Artist.create_or_find_by(name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-03-14 22:20:08.013299"], ["updated_at", "2019-03-14 22:20:08.013299"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-03-14 22:20:08.014814"], ["updated_at", "2019-03-14 22:20:08.014814"], ["artist_id", 138]]